1) Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd
pd_series = pd.Series([4,8,15,16,23,42])

print(pd_series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

2) Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [2]:
lst = [1,2,3,4,5,6,7,8,9,10]
pd.Series(lst)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

3) Create a Pandas DataFrame.

In [3]:
data = {"Name":["Alice","Bob","Claire"],
        "Age":[25,30,27],
        "Gender":["Female","Male","Female"]}

df = pd.DataFrame(data)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

4) What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
- DataFrame is basically defined as tabular form of data that contains multiple rows and columns.
- we can considered pandas.series as List (Not exactly).In Series we will be able to extract data only with the help of in-built indexes whereas in DataFrame we will be able to extract data through in-built indexes as well as through column names.

In [4]:
ps_series = pd.Series([1,0,1,23,4,7,9])
df = pd.DataFrame(data)

In [5]:
ps_series[3]

23

In [6]:
df["Name"][1]

'Bob'

5) What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Functions which we will be able to implement on pandas DataFrame:
- .describe(), .head(), .tail(), .columns, .dtypes, .categorical(), .unique(), .iloc(), .loc()

In [5]:
# Let's try to understand some of these functions:
df = pd.read_csv("country_code.csv")
df

                  Name Code
0          Afghanistan   AF
1        Åland Islands   AX
2              Albania   AL
3              Algeria   DZ
4       American Samoa   AS
..                 ...  ...
244  Wallis and Futuna   WF
245     Western Sahara   EH
246              Yemen   YE
247             Zambia   ZM
248           Zimbabwe   ZW

[249 rows x 2 columns]

In [6]:
df.head(3)

            Name Code
0    Afghanistan   AF
1  Åland Islands   AX
2        Albania   AL

In [7]:
df.tail(3)

         Name Code
246     Yemen   YE
247    Zambia   ZM
248  Zimbabwe   ZW

In [10]:
df.iloc[0:2]

            Name Code
0    Afghanistan   AF
1  Åland Islands   AX

In [13]:
df.loc[0:2, "Code"]

0    AF
1    AX
2    AL
Name: Code, dtype: object

6) Which of the following is mutable in nature Series, DataFrame, Panel?
- DataFrame and Panel are basically mutable in nature because we can modify both size and data in case of both of them.
- Whereas in case of pandas Series we can not modify size of it once it will be declared.

7) Create a DataFrame using multiple Series. Explain with an example.

In [17]:
s1 = pd.Series([1,2,3,4])
s2 = pd.Series([11,22,33,44])
s3 = pd.Series([10,20,30,40])

df = pd.DataFrame([s1, s2, s3])
df

    0   1   2   3
0   1   2   3   4
1  11  22  33  44
2  10  20  30  40